app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "slackhandle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "Collins@gmail.com"], ["name", "Collins"], ["slackhandle", "collo"], ["created_at", "2023-01-11 13:55:23.984277"], ["updated_at", "2023-01-11 13:55:23.984277"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save