app/controllers/welcome_controller.rb

SELECT "rides".* FROM "rides"
---
  def index
    # Return all rides available no matter its type
    @rides = Ride.all